[
    {
        "id": "1",
        "type": "thief",
        "description": "A shady thief lurks in a dark corner",
        "outcome_positive": " eyeing you suspiciously. He steps forward and says",
        "outcome_negative": " \"I can take whatever I want from you",
        "reward_type": " but I'll be nice. Hand over some of your money",
        "reward_amount": " or I'll make you regret it.\"",
        "penalty_type": "Fight him and lose 10 health",
        "penalty_amount": " or lose 20% of your money.",
        "null": []
    },
    {
        "id": "2",
        "type": "cop",
        "description": "A stern-looking police officer stands nearby",
        "outcome_positive": " watching the crowd. He locks eyes with you and says",
        "outcome_negative": " \"Stay out of trouble",
        "reward_type": " or I'll have to deal with you.\" He observes you carefully.",
        "reward_amount": "The cop gives you a friendly nod and some useful advice.",
        "penalty_type": "He fines you for bribery and walks away with a disappointed look.",
        "penalty_amount": "health",
        "null": []
    },
    {
        "id": "3",
        "type": "old-man",
        "description": "An old man sits on the ground",
        "outcome_positive": " begging for help. \"I’ve been stuck here for years",
        "outcome_negative": " he says. Please",
        "reward_type": " give me 10 coins so I can buy a ticket home. I just want to go back to my family.\" His eyes are filled with desperation.",
        "reward_amount": "Give him the 10 coins",
        "penalty_type": " and he thanks you with tears in his eyes. He says",
        "penalty_amount": " \"I will never forget your kindness.\"",
        "null": []
    },
    {
        "id": "4",
        "type": "woman",
        "description": "A local woman stands by the side of the road. She looks hungry and tired. \"I haven’t eaten all day",
        "outcome_positive": " she says softly. Could you buy me a meal? I’ll even repay you in some way",
        "outcome_negative": " she adds hopefully.,You offer her a meal, and she hands you a health pack, saying, This should help you.\" You feel a sense of warmth for helping her.",
        "reward_type": "You buy her a meal",
        "reward_amount": " but you lose 15 coins. She gives you a health pack",
        "penalty_type": " but you can't help feeling like you've given more than expected.",
        "penalty_amount": "money",
        "null": []
    },
    {
        "id": "5",
        "type": "trash",
        "description": "You come across a pile of trash in an alley. You hesitate but then decide to check it out. As you dig through the garbage",
        "outcome_positive": " you find either some loose change or something dangerous.",
        "outcome_negative": "You find 10 coins",
        "reward_type": " a small blessing from the trash.",
        "reward_amount": "You cut your hand on a broken bottle and feel a sharp pain. You start feeling ill from the injury.",
        "penalty_type": "money",
        "penalty_amount": "10",
        "null": []
    },
    {
        "id": "6",
        "type": "store",
        "description": "A small",
        "outcome_positive": " run-down store stands in front of you. The owner greets you and says",
        "outcome_negative": " \"I’ve got health packs for sale. I can help you out for just 5 coins. They’ll get you back on your feet!\"",
        "reward_type": "You buy a health pack for 5 coins and feel better as your health improves.",
        "reward_amount": "You walk away with no purchase, but the storekeeper seems unfazed.",
        "penalty_type": "health",
        "penalty_amount": "5",
        "null": []
    }
]